[
    {
        "callTime": "7/21/24 8:00",
        "type": "Satisfied",
        "score": 90,
        "botId": "Fiber",
        "title": "Fiber Internet Setup",
        "imgURL": "/assets/images/product-laptop.jpg",
        "transcript": [
            "AI Agent: Hi, I'm Jeremy, part of the customer representative team here to answer your requests. Can you please explain your concern?",
            "User: Hi.",
            "User: I just had Fiber installed, but I'm having trouble setting it up.",
            "AI Agent: I’m here to help. What seems to be the problem with the setup?",
            "User: I can’t seem to get a connection.",
            "AI Agent: Have you followed all the setup instructions provided with the equipment?",
            "User: I think so, but it's still not working.",
            "AI Agent: Let me guide you through the setup process. Can you please confirm your address to ensure we have the correct information?",
            "User: My name is David Johnson, and I'm in Austin, Texas.",
            "AI Agent: Thank you, Mr. Johnson. I'll assist you with the setup process. Please hold on.",
            "AI Agent: I see that everything is properly set up from our end. Can you try connecting again?",
            "User: Okay, I'll try.",
            "User: It looks like it's working now. Thanks for your help!",
            "AI Agent: You're welcome! If you have any more issues or need further assistance, feel free to call back. Have a great day!",
            "User: Thank you. Goodbye!",
            "AI Agent: Goodbye!"
        ]
    },
    {
        "callTime": "7/22/24 14:00",
        "type": "Frustrated",
        "score": 40,
        "botId": "Wireline",
        "title": "Intermittent Phone Service",
        "imgURL": "/assets/images/product-laptop.jpg",
        "transcript": [
            "AI Agent: Hi, I'm Jeremy, part of the customer representative team here to answer your requests. Can you please explain your concern?",
            "User: Hi.",
            "User: My wireline phone service is intermittent. It works sometimes and then it stops.",
            "AI Agent: I'm sorry to hear that. How often does the issue occur?",
            "User: It happens throughout the day, with no clear pattern.",
            "AI Agent: Have you checked if the phone line is securely connected and if any equipment is faulty?",
            "User: Yes, everything seems fine.",
            "AI Agent: I’ll check if there are any issues with the phone lines in your area. Can you please provide your name and address?",
            "User: My name is Lisa Williams, and I'm in Boston, Massachusetts.",
            "AI Agent: Thank you, Ms. Williams. I’ll investigate and get back to you shortly. Please hold on.",
            "AI Agent: I checked, and there is a known issue affecting phone lines in your area. Our team is working on it.",
            "User: That explains it. How long will it take to fix?",
            "AI Agent: It should be resolved within the next 24 hours. We will notify you once the issue is fixed.",
            "User: Alright, thank you for the information.",
            "AI Agent: You’re welcome! If you have any other questions or need further assistance, please let us know.",
            "User: Will do. Goodbye!",
            "AI Agent: Goodbye!"
        ]
    },
    {
        "callTime": "7/23/24 9:00",
        "type": "Angry",
        "score": 25,
        "botId": "Wireless",
        "title": "No Service",
        "imgURL": "/assets/images/product-laptop.jpg",
        "transcript": [
            "AI Agent: Hi, I'm Jeremy, part of the customer representative team here to answer your requests. Can you please explain your concern?",
            "User: Hi.",
            "User: I have no service on my wireless phone. I can’t make or receive calls.",
            "AI Agent: I’m sorry to hear that. Is this happening in a specific location or everywhere?",
            "User: It’s happening everywhere.",
            "AI Agent: Have you tried restarting your phone or checking if there’s an outage in your area?",
            "User: Yes, I’ve done both.",
            "AI Agent: I’ll check your account status and any possible network issues. Can you please confirm your name and location?",
            "User: My name is Sofia Martinez, and I’m in San Diego, California.",
            "AI Agent: Thank you, Ms. Martinez. I’ll investigate the issue and update you soon. Please hold on.",
            "AI Agent: I see that there’s a major outage affecting your area. We’re working on restoring service as quickly as possible.",
            "User: How long will it take to fix?",
            "AI Agent: The estimated restoration time is within the next 2 hours. We’ll send you an update once the service is back.",
            "User: Okay, thank you.",
            "AI Agent: You’re welcome! If you need further assistance, don’t hesitate to contact us.",
            "User: Will do. Goodbye!",
            "AI Agent: Goodbye!"
        ]
    },
    {
        "callTime": "7/24/24 16:00",
        "type": "Happy",
        "score": 85,
        "botId": "Fiber",
        "title": "Speed Improvement",
        "imgURL": "/assets/images/product-laptop.jpg",
        "transcript": [
            "AI Agent: Hi, I'm Jeremy, part of the customer representative team here to answer your requests. Can you please explain your concern?",
            "User: Hi.",
            "User: My Fiber internet speed seems to have improved, but I’m still not getting the speeds I was promised.",
            "AI Agent: I’m glad to hear there’s been some improvement. Can you tell me what speeds you are currently getting and what you were promised?",
            "User: I’m getting around 100 Mbps, but I was promised 300 Mbps.",
            "AI Agent: Let me check your account details and see if there’s an issue affecting your speeds. Can you please confirm your name and address?",
            "User: My name is Emily Davis, and I’m in Orlando, Florida.",
            "AI Agent: Thank you, Ms. Davis. I’ll process the upgrade request and get back to you shortly. Please hold on.",
            "AI Agent: It looks like your current plan is not matching the promised speeds. I’ll arrange for a technician to visit and resolve the issue.",
            "User: That sounds good. When can the technician come?",
            "AI Agent: We can schedule a visit for tomorrow afternoon. Does that work for you?",
            "User: Yes, that works.",
            "AI Agent: Great. The technician will arrive between 1 PM and 3 PM tomorrow. You’ll receive a confirmation shortly.",
            "User: Thank you for your help.",
            "AI Agent: You’re welcome! If you have any other questions or need further assistance, feel free to reach out.",
            "User: Will do. Goodbye!",
            "AI Agent: Goodbye!"
        ]
    },
    {
        "callTime": "7/25/24 11:00",
        "type": "Unsure",
        "score": 45,
        "botId": "Wireless",
        "title": "Coverage Issues",
        "imgURL": "/assets/images/product-laptop.jpg",
        "transcript": [
            "AI Agent: Hi, I'm Jeremy, part of the customer representative team here to answer your requests. Can you please explain your concern?",
            "User: Hi.",
            "User: I’m experiencing coverage issues with my wireless service. The signal is weak in certain areas of my house.",
            "AI Agent: I’m sorry to hear that. Have you checked if the issue is related to the distance from the router or any physical obstructions?",
            "User: Yes, but the signal is still weak.",
            "AI Agent: I’ll check your account and see if there are any network issues affecting your coverage. Can you please confirm your name and location?",
            "User: My name is Rachel Green, and I’m in Houston, Texas.",
            "AI Agent: Thank you, Ms. Green. I’ll investigate and get back to you shortly. Please hold on.",
            "AI Agent: I see that your area has some reported signal issues. We’re working on improving coverage.",
            "User: How long will it take to fix?",
            "AI Agent: The improvements should be completed within 48 hours. We’ll update you once the situation is resolved.",
            "User: Okay, thanks for the update.",
            "AI Agent: You’re welcome! If you have any other concerns, please let us know.",
            "User: I will. Goodbye!",
            "AI Agent: Goodbye!"
        ]
    },
    {
        "callTime": "7/26/24 14:00",
        "type": "Frustrated",
        "score": 55,
        "botId": "Fiber",
        "title": "Connection Drops",
        "imgURL": "/assets/images/product-laptop.jpg",
        "transcript": [
            "AI Agent: Hi, I'm Jeremy, part of the customer representative team here to answer your requests. Can you please explain your concern?",
            "User: Hi.",
            "User: My Fiber connection drops frequently throughout the day.",
            "AI Agent: I’m sorry to hear that. How often does the connection drop?",
            "User: It drops multiple times a day, and it’s really frustrating.",
            "AI Agent: Have you checked if the issue might be related to the modem or router?",
            "User: Yes, I’ve checked everything and restarted the equipment.",
            "AI Agent: I’ll look into your account and check if there are any issues affecting your connection. Can you please confirm your name and address?",
            "User: My name is John Smith, and I’m in Seattle, Washington.",
            "AI Agent: Thank you, Mr. Smith. I’ll investigate the issue and get back to you shortly. Please hold on.",
            "AI Agent: There seems to be a fault with the line in your area. We’re arranging a technician visit to resolve it.",
            "User: When will the technician be available?",
            "AI Agent: We can schedule a visit for tomorrow morning. Does that work for you?",
            "User: Yes, that works.",
            "AI Agent: Great. The technician will arrive between 9 AM and 11 AM tomorrow. You’ll receive a confirmation shortly.",
            "User: Thank you.",
            "AI Agent: You’re welcome! If you have any other questions or need further assistance, feel free to reach out.",
            "User: Will do. Goodbye!",
            "AI Agent: Goodbye!"
        ]
    },
    {
        "callTime": "7/27/24 13:00",
        "type": "Satisfied",
        "score": 85,
        "botId": "Wireline",
        "title": "New Installation",
        "imgURL": "/assets/images/product-laptop.jpg",
        "transcript": [
            "AI Agent: Hi, I'm Jeremy, part of the customer representative team here to answer your requests. Can you please explain your concern?",
            "User: Hi.",
            "User: I just had a new wireline phone line installed, but I'm not sure if it's working correctly.",
            "AI Agent: I can help with that. Can you please describe any issues you're experiencing?",
            "User: I’m not sure if it’s working because I haven’t received any calls yet.",
            "AI Agent: Let’s test the line to make sure everything is set up correctly. Can you please confirm your address?",
            "User: My name is Karen Brown, and I’m in Philadelphia, Pennsylvania.",
            "AI Agent: Thank you, Ms. Brown. I’ll verify your installation status and ensure everything is working as it should. Please hold on.",
            "AI Agent: I’ve confirmed that your line is active. You should be able to make and receive calls now.",
            "User: Great! Thanks for confirming.",
            "AI Agent: You’re welcome! If you have any further questions or issues, feel free to contact us.",
            "User: Will do. Goodbye!",
            "AI Agent: Goodbye!"
        ]
    },
    {
        "callTime": "7/28/24 15:00",
        "type": "Happy",
        "score": 90,
        "botId": "Wireless",
        "title": "Service Quality",
        "imgURL": "/assets/images/product-laptop.jpg",
        "transcript": [
            "AI Agent: Hi, I'm Jeremy, part of the customer representative team here to answer your requests. Can you please explain your concern?",
            "User: Hi.",
            "User: I just wanted to say that I’m very satisfied with the quality of my wireless service.",
            "AI Agent: That’s wonderful to hear! Is there anything specific you’d like to mention or any feedback you’d like to provide?",
            "User: No, everything is working perfectly.",
            "AI Agent: I’m glad to hear that. We appreciate your positive feedback.",
            "User: Thank you for your help.",
            "AI Agent: You’re welcome! If you have any other questions or need further assistance, don’t hesitate to contact us.",
            "User: I will. Goodbye!",
            "AI Agent: Goodbye!"
        ]
    },
    {
        "callTime": "7/29/24 12:00",
        "type": "Unsure",
        "score": 50,
        "botId": "Fiber",
        "title": "Plan Details",
        "imgURL": "/assets/images/product-laptop.jpg",
        "transcript": [
            "AI Agent: Hi, I'm Jeremy, part of the customer representative team here to answer your requests. Can you please explain your concern?",
            "User: Hi.",
            "User: I’m not sure which Fiber plan would be best for me.",
            "AI Agent: I’d be happy to help you with that. Can you tell me a bit about your usage and needs?",
            "User: I mostly use the internet for streaming and working from home.",
            "AI Agent: Based on your usage, I’d recommend our high-speed Fiber plans. Let me provide you with details on the available options.",
            "User: That sounds good. What are the options?",
            "AI Agent: We have several plans ranging from 300 Mbps to 1 Gbps. I can help you choose based on your budget and speed requirements.",
            "User: I’m leaning towards the 1 Gbps plan.",
            "AI Agent: I’ll process the request for the 1 Gbps plan. Can you please confirm your name and address?",
            "User: My name is William Harris, and I’m in Denver, Colorado.",
            "AI Agent: Thank you, Mr. Harris. I’ll update your plan and confirm the changes shortly. Please hold on.",
            "AI Agent: Your plan has been updated to 1 Gbps. You should see the changes reflected within the next 24 hours.",
            "User: Great, thank you.",
            "AI Agent: You’re welcome! If you have any more questions or need assistance, feel free to reach out.",
            "User: Will do. Goodbye!",
            "AI Agent: Goodbye!"
        ]
    },
    {
        "callTime": "7/30/24 10:00",
        "type": "Frustrated",
        "score": 50,
        "botId": "Wireline",
        "title": "Static on Line",
        "imgURL": "/assets/images/product-laptop.jpg",
        "transcript": [
            "AI Agent: Hi, I'm Jeremy, part of the customer representative team here to answer your requests. Can you please explain your concern?",
            "User: Hi.",
            "User: I’m hearing a lot of static on my wireline phone line.",
            "AI Agent: I’m sorry to hear that. Does the static occur all the time, or is it intermittent?",
            "User: It’s constant and very annoying.",
            "AI Agent: Have you tried checking the phone line connections and any potential interference?",
            "User: Yes, but the static persists.",
            "AI Agent: I’ll look into your account and check if there are any issues with your phone service. Can you please provide your name and address?",
            "User: My name is Mark Wilson, and I’m in Nashville, Tennessee.",
            "AI Agent: Thank you, Mr. Wilson. I’ll investigate the issue and update you soon. Please hold on.",
            "AI Agent: I checked, and there is a known issue affecting phone lines in your area. Our team is working on it.",
            "User: How long will it take to fix?",
            "AI Agent: The estimated time for resolution is within the next 24 hours. We will notify you once it’s fixed.",
            "User: Okay, thank you.",
            "AI Agent: You’re welcome! If you have any further questions or need assistance, feel free to contact us.",
            "User: I will. Goodbye!",
            "AI Agent: Goodbye!"
        ]
    },
    {
        "callTime": "7/31/24 17:00",
        "type": "Satisfied",
        "score": 85,
        "botId": "Fiber",
        "title": "Upgrade Request",
        "imgURL": "/assets/images/product-laptop.jpg",
        "transcript": [
            "AI Agent: Hi, I'm Jeremy, part of the customer representative team here to answer your requests. Can you please explain your concern?",
            "User: Hi.",
            "User: I’d like to upgrade my Fiber plan to a higher speed.",
            "AI Agent: I can help with that. What speed are you looking to upgrade to?",
            "User: I want to upgrade to 1 Gbps.",
            "AI Agent: I’ll check the available options for you. Can you please confirm your current plan and address?",
            "User: My name is Sarah Lee, and I’m in Chicago, Illinois.",
            "AI Agent: Thank you, Ms. Lee. I’ll process the upgrade request and get back to you shortly. Please hold on.",
            "AI Agent: It looks like everything is in order. Your upgrade to 1 Gbps will be processed, and you’ll receive a confirmation email soon.",
            "User: Great! Thank you for your assistance.",
            "AI Agent: You’re welcome! If you have any other questions or need further help, feel free to reach out.",
            "User: Will do. Goodbye!",
            "AI Agent: Goodbye!"
        ]
    },
    {
        "callTime": "8/1/24 12:00",
        "type": "Frustrated",
        "score": 45,
        "botId": "Wireless",
        "title": "Dropped Calls",
        "imgURL": "/assets/images/product-laptop.jpg",
        "transcript": [
            "AI Agent: Hi, I'm Jeremy, part of the customer representative team here to answer your requests. Can you please explain your concern?",
            "User: Hi.",
            "User: I’m experiencing dropped calls frequently on my wireless phone.",
            "AI Agent: I’m sorry to hear that. Is the issue occurring in specific locations or everywhere?",
            "User: It happens everywhere.",
            "AI Agent: Have you checked if there are any known outages or issues with the network in your area?",
            "User: Yes, I’ve checked and there doesn’t seem to be any outage.",
            "AI Agent: I’ll look into your account and see if there’s a problem with your service. Can you please confirm your name and address?",
            "User: My name is Alex Moore, and I’m in Minneapolis, Minnesota.",
            "AI Agent: Thank you, Mr. Moore. I’ll investigate the issue and get back to you shortly. Please hold on.",
            "AI Agent: I’ve found that there are some network issues affecting your area. We’re working on resolving them.",
            "User: How long will it take to fix?",
            "AI Agent: The issue should be resolved within the next 48 hours. We’ll keep you updated on the progress.",
            "User: Alright, thanks for the information.",
            "AI Agent: You’re welcome! If you have any further questions or need assistance, feel free to contact us.",
            "User: Will do. Goodbye!",
            "AI Agent: Goodbye!"
        ]
    }
]
